КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул2/КонтурЛогистика_ПЛ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфМО</name>
    <comment>Дата формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфМО</name>
    <comment>Время формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфСоб</name>
    <comment>Дата формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфСоб</name>
    <comment>Время формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфСоб</name>
    <comment>Идентификатор файла обмена Т1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПСоб</name>
    <comment>Электронная подпись файла обмена информации об обстоятельствах и особенностях рейса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМОПредсменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>текст содержащий причину отказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <comment>Лицензия на осущ. мед. деятельности</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул2/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаПЛ(Данные, Представление, СтандартнаяОбработка, "2");
	
КонецПроцедуры

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	МассивОбязательных.Добавить("УИД_ПЛ");
	МассивОбязательных.Добавить("МедРаботник");
	МассивОбязательных.Добавить("МедЛицензия");
	МассивОбязательных.Добавить("ДатВрПрМО");
	МассивОбязательных.Добавить("Водитель");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ПЛ");
	МассивКлючевых.Добавить("Титул1");
	МассивКлючевых.Добавить("ДатФайлИнфСоб");
	МассивКлючевых.Добавить("ВрФайлИнфСоб");
	МассивКлючевых.Добавить("ИдФайлИнфСоб");
	МассивКлючевых.Добавить("ЭПСоб");
	МассивКлючевых.Добавить("ВидМОПредсменный");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфМО");
	МассивКлючевых.Добавить("ВрИнфМО");
	
	Возврат МассивКлючевых;
	
КонецФункции



// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено, ПроверкаСквозногоСценария = Ложь) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.Титул1, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПроверкаСквозногоСценария);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок, ПроверкаСквозногоСценария = Ложь)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументТитул1 = Объект.Титул1;
	
	Если НЕ ЗначениеЗаполнено(ДокументТитул1)  Тогда
		
		ТекстОшибки = "Титул не привязан к первому титулу Путевого листа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументТитул1", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭПСоб)  Тогда
		
		ТекстОшибки = "Не получена подпись сотавителя Т1. Попробуйте выполнить обмен и перезаполнить титул";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭПСоб", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Если Объект.ЕстьОтказВПодписи И Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
		
		ТекстОшибки = "Не указана причина отказа в подписи";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" Или Прав(ОбязательныйРевизит, 14) = "МассивСтруктур"
			Или (ПроверкаСквозногоСценария И ОбязательныйРевизит = "УИД_ПЛ") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ПЛ_Титул2.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик) Тогда 
		
		Если Не ДокументТитул1.ОрганизацияМедик.Наш Тогда 
			ТекстОшибки = "Организация проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументТитул1ЛицоМедик", КатегорияОшибка, ТекстОшибки, "Ошибка");
		КонецЕсли;
		
	Иначе
		Если Не ДокументТитул1.ЛицоОформившееПЛ.Наш Тогда 
			ТекстОшибки = "Организация оформившая ПЛ и проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументТитул1ЛицоОформившее", КатегорияОшибка, ТекстОшибки, "Ошибка");
		КонецЕсли;
	КонецЕсли;
	
	// Водитель
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок,
		КатегорияОшибка,, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2, Объект.Титул1);
	
	// МедЛицензия
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьМедЛицензию(Объект, ТаблицаОшибок);
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ПЛ_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
